${TOTALTEST_JOBCARD}  
//*** SPECIFY JOBCARD IN TOTALTEST PREFERENCES TO SUBSTITUTE 
//***    
//*** THE JOB CARD MUST INCLUDE A NOTIFY STATEMENT SUCH  
//*** AS NOTIFY=&SYSUID AND ALSO A REGION=0M PARAMETER 
//*   
//********************************************************************
//* EXECUTE RUNNER IN AN IMS ENVIRONMENT WITH DB2     
//********************************************************************
//RUNBMP EXEC PGM=DFSRRC00,REGION=4096K, 
//   PARM=(BMP,TTTRUNNR,,,,,,,,,,,,,,,,,,)
//*  
//* THE PARM STRING ABOVE SHOULD BE TAKEN FROM YOUR STANDARD JCL 
//*  THAT EXECUTES THE TARGET PROGRAM, BUT WITH THE SECOND PARAMETER  
//*  REPLACED WITH TTTRUNNR.  ALL OTHER PARAMETERS SHOULD BE COPIED
//*  FROM THE NORMAL JCL USED TO EXECUTE THE TARGET PROGRAM.
//*                             
//*
//* YOU NEED TO MODIFY THE FOLLOWING DD STATEMENTS.
//*                                 
//* THE STEPLIB CONCATENATION SHOULD INCLUDE THE LOADLIB 
//* CONTAINING THE TOPAZ FOR TOTAL TEST 'TTTRUNNR' PROGRAM 
//* AND THE COBOL RUNTIME(CEE.SCEERUN) AND ALL LOAD LIBRARIES
//* NEEDED IN SUPPORT OF THE IMS BMP TARGET PROGRAM. 
//* CONTAINING THE PROGRAMS TO RUN DURING THE TEST.  
//*                                     
//* THE SECOND DD STATEMENT IS ONLY REQUIRED IF RUNNING THE JCL 
//* FROM TOPAZ FOR TOTAL TEST CLI WITH CODE COVERAGE SUPPORT.
//* IF TESTING AN LE APPLICATION IT SHOULD BE CHANGED TO THE 
//* LOADLIB CONTAINING THE COBOL RUNTIME(CEE.SCEERUN), OTHERWISE 
//* IT CAN BE REMOVED.  
//*                
//STEPLIB DD DISP=SHR,DSN=CPWR.MLCXNNN.SLCXLOAD 
//*        DD DISP=SHR,DSN=CEE.SCEERUN             CEE RUNTIME
//*        DD DISP=SHR,DSN=USER.LOADLIB            USER LOADLIB
//*        DD DISP=SHR,DSN=IMS.LIB                 IMS LIBRARY(IES)
//*        DD DISP=SHR,DSN=DB2.LIB                 DB2 LIBRARY(IES)
//*PROCLIB DD DISP=SHR,DSN=IMS.PROCLIB             IMS PROCLIB
//* -------------------------------------------------------
//*IMS     DD DISP=SHR,DSN=IMS.PSBLIB              NEEDED IF GSAM USED
//*        DD DISP=SHR, DSN=IMS.DBDLIB             NEEDED IF GSAM USED
//* INCLUDE ALL DD STATEMENTS NEEDED BY THE TARGET BMP PROGRAM 
//*    
//TRPARM DD *   
*             
*        OPTIONALLY SET YOUR CUSTOM EXIT PROGRAM HERE: 
*                        
EXIT(NONE)    
*               
REPEAT(${TOTALTEST_REPEAT}),STUBS(${TOTALTEST_STUBS}),
ARGTYPE(IMSMAIN), 
DEBUG(OFF) 
/*                                      
//BININP DD DSN=${TOTALTEST_BININP},DISP=OLD
//BINREF DD DSN=${TOTALTEST_BINREF},DISP=OLD
//BINRES DD DSN=${TOTALTEST_BINRES},DISP=OLD
//SYSUDUMP DD SYSOUT=*        
